frontend/controllers/TravelController.php

INSERT INTO `reply` (`re_content`, `t_id`, `u_id`, `date`) VALUES ('用户哪去了，怎么还是写死的呢？\r\n', 16, 4, '2016-03-30 08:03:59 ')
---
	public function actionReply()
	{
		$this->layout="header";
		$session = Yii::$app->session;
        $session->open();
		if(isset($_SESSION['u_id'])){
		$content = $_POST['content'];
		$t_id = $_POST['t_id'];
		$session = $_SESSION['u_id'];
		date_default_timezone_set('PRC');
		$date = date('Y-m-d h:m:s ',time());
		$u_id = $_POST['u_id'];
		$connection = \Yii::$app->db;
		$re = $connection->createCommand()->insert('reply', [
		're_content' => $content,
		't_id' => $t_id,
		'u_id' => $session,
		'date' => $date,
		'u_id' => $u_id,
		])->execute();