frontend/models/Friendlist.php

SELECT * FROM `friendlist`
---
	 public function alllist()
	 {
		 return $this->find()->asArray()->all();