frontend/models/Gropshop.php

SELECT * FROM `gropshop` WHERE `c_id`='1' ORDER BY `g_num` DESC
SELECT * FROM `gropshop` WHERE `c_id`='1' ORDER BY `g_num` DESC LIMIT 4
---
    public function hotels($id)
    {
        $alls = $this->find()->where(['c_id'=>$id])->orderBy(['g_num'=>SORT_DESC])->asArray()->all();
        if(count($alls)>4)
        {
            $alls = $this->find()->where(['c_id'=>$id])->orderBy(['g_num'=>SORT_DESC])->limit(4)->asArray()->all();