frontend/models/Kefu.php

SELECT * FROM `kefu`
---
	 public function allkefu()
	 {
		 return $this->find()->asArray()->all();