frontend/models/Travel.php

    public function searchsix()
    {
        return $this->find()->select('*')
            ->innerJoin('city',"travel.c_id = city.c_id")
            ->innerJoin('season',"travel.s_id = season.s_id")
            ->orderBy(['click_num'=>SORT_DESC])
            ->limit(6)
            ->asArray()
            ->all();
---
SELECT * FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id ORDER BY `click_num` DESC LIMIT 6

    public function seasons()
    {
        $time = date('m',time());
        if($time>=3 && $time<6)
        {
            $season = 1;
        }
        else if($time>=6 && $time<9)
        {
            $season = 2;
        }
        else if($time>=9 && $time<11)
        {
            $season = 3;
        }
        else
        {
            $season = 4;
        }
            $sql = $this->find()
            ->innerJoin('city',"travel.c_id = city.c_id")
            ->innerJoin('season',"travel.s_id = season.s_id")
            ->where(['travel.s_id'=>$season])
           ->orderBy(['click_num'=>SORT_DESC])->select('*');
        //return  $sql->asArray()->all();die;

        $sql1 = clone $sql;
        $pages = new Pagination([
            'totalCount'=>$sql1->count(),
            'defaultPageSize'=>3,
        ]);
---
SELECT * FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id WHERE `travel`.`s_id`=1 ORDER BY `click_num` DESC LIMIT 3
SELECT COUNT(*) FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id WHERE `travel`.`s_id`=1 ORDER BY `click_num` DESC

    public function hotcity()
    {
        $city = $this->find()->select("c_id")->asArray()->all();
        foreach($city as $k=>$v)
        {
            $arr[$k]=$v['c_id'];
        }
       $hots= array_count_values($arr);
        arsort($hots);
        foreach($hots as $k=>$v)
        {
            $city = new City();
            $citys[] = $city->find()->where(['c_id'=>$k])->asArray()->one();
---
SELECT `c_id` FROM `travel`
SELECT * FROM `city` WHERE `c_id`=1

    public function detseason($id)
    {
         $viewspots = $this->find()
             ->innerJoin('city',"travel.c_id = city.c_id")
             ->innerJoin('season',"travel.s_id = season.s_id")
             ->where(['travel.t_id'=>$id])
             ->select('*')
             ->asArray()
             ->one ();
        //点击一次，点击量加一
        $res = Yii::$app->db->createCommand()->update('travel',['click_num'=>$viewspots['click_num']+1],['t_id'=>$id])->query();
        $city_id = $viewspots['c_id'];
        /*查询这个景点所在地区的推荐酒店（点击量）*/
        $hotel = new Gropshop();
        $hotels = $hotel->find()->where(['c_id'=>$city_id])->all();
        if(count($hotels)>4)
        {
            $hotels = $hotel->find()->where(['c_id'=>$city_id])->limit(4)->all();
---
SELECT * FROM `travel` INNER JOIN `city` ON travel.c_id = city.c_id INNER JOIN `season` ON travel.s_id = season.s_id WHERE `travel`.`t_id`='1'
SELECT * FROM `gropshop` WHERE `c_id`='1'
SELECT * FROM `gropshop` WHERE `c_id`='1' LIMIT 4

    public function cityview($id)
    {
        $all = $this->find()->where(['c_id'=>$id])->asArray()->all();
        if(count($all)>4)
        {
            $all = $this->find()->where(['c_id'=>$id])->orderBy(['click_num'=>SORT_DESC])->limit(4)->asArray()->all();
---
SELECT * FROM `travel` WHERE `c_id`='1'
SELECT * FROM `travel` WHERE `c_id`='1' ORDER BY `click_num` DESC LIMIT 4

    public function allview()
    {
        $sql = $this->find();
        $quer = clone $sql;
        $pages = new Pagination([
            'totalCount'=>$quer->count(),
            'defaultPageSize'=>8,
        ]);
        $info = $sql->offset($pages->offset)
            ->limit($pages->limit)
            ->all();
---
SELECT COUNT(*) FROM `travel`
SELECT * FROM `travel` LIMIT 8